<template>
  <h2>1、自我介绍</h2>
  <p>回答：面试官你好，我叫李浩达，是宿州学院21届毕业生。大学学的专业是软件工程，当时在大学的时候选择了前端这一行业方向嘛，然后就通过学校课程和在网上找教程学习前端，然后大四下学期开始在公司实习，毕业后就在实习公司转正。在之前公司的话主要参与开发的项目类型有微信公众号，后台管理系统，微信小程序。</p>
  <h2>慧薪福公众号</h2>
  <p>项目背景：慧薪福公众号的话是一个灵活用工平台，</p>
  <p>主要参与功能：主要开发了项目中心这一模块功能，里面包含项目大厅和我的项目两部分，页面中通过tab标签页组件形式展示两个部分，项目大厅展示的是企业发布的项目，我的项目展示的是个人报名参加的项目</p>
  <p>项目知识点：页面通过mescrolljs框架实现上拉加载和下拉刷新功能</p>
  <p>公众号通过自定义菜单设置底部菜单，点击跳转网页</p>
  <h2>慧薪福后台管理系统</h2>
  <p>项目背景：慧薪福是对应慧薪福公众号的后台管理系统</p>
  <p>项目知识点</p>
  <ul>
    <li>合同管理：通过antdesign组件的表格组件展示合同列表，每条合同信息包含下载操作按钮，点击下载可以将合同文件下载到本地</li>
    <li>合同模板：通过antdesign的表单组件实现上传合同，填写合同的基本字段然后上传合同文件然后将这些信息上传给后端</li>
    <li>项目管理：通过表格组件展示已发布的项目</li>
    <li>基本信息：展示登录用户的基本信息比如所属公司，联系人姓名，联系人电话等</li>
  </ul>
  <p>复杂点：</p>
  <ul>
    <li>权限管理：路由权限是通过在路由上添加标记信息，然后通过导航守卫在路由跳转前进行判断。菜单权限的话我们是使用ui组件的menu导航实现的，前端在定义菜单项时会给菜单项添加标记信息，然后展示菜单的时候根据登录时后端返回的用户的权限信息展示相应的菜单项。页面的一些操作按钮我们也是根据用户的权限信息判断是否展示</li>
    <li>下载文件：通过a标签，href值为后端返回的文件地址，可以通过download重命名文件名</li>
  </ul>
  <h2>苏鹰商城小程序</h2>
  <p>项目背景：一个商城类的小程序</p>
  <p>主要参与功能：我的模块包含用户订单显示，地址设置，设置模块包含隐私协议，个人信息更改，关于我们等。接入第三方客服系统。首页商品搜索模块。 通过小程序的map的组件和腾讯位置服务的搜索地点功能实现展示南京市内各个区的座上客的门店列表信息</p>
</template>

<script lang="ts" setup>

</script>

<style lang="less" scoped>
</style>